#include <iostream>
using namespace std;

int main() {
    // 1. Задано ціле число А. Якщо А – додатне число, то додати до нього 1, в іншому випадку відняти від нього 2.
    //int A;
    //cout << "Введіть число A: ";
    //cin >> A;

    //if (A > 0) {
    //    A += 1;
    //}
    //else {
    //    A -= 2;
    //}
    //cout << "Результат 1: " << A << endl;

    // 2. Задано два значення А і В. Визначити, чи А дорівнює В.
    //int B;
    //cout << "Введіть число B: ";
    //cin >> B;

    //if (A == B) {
    //    cout << "A дорівнює B" << endl;
    //}
    //else {
    //    cout << "A не дорівнює B" << endl;
    //}

    // 3. Задано два значення А і В. Якщо значення не є рівними, присвоїти А значення В.
    //if (A != B) {
    //    A = B;
    //    cout << "Тепер A дорівнює B: A = " << A << endl;
    //}

    //// 4. Задано два нерівних значення А і В. Відняти від більшого числа менше.
    //if (A != B) {  // Припускається, що A та B нерівні
    //    if (A > B) {
    //        A -= B;
    //    }
    //    else {
    //        B -= A;
    //    }
    //    cout << "Результат 4: більше мінус менше = " << (A > B ? A : B) << endl;
    //}
    //else {
    //    cout << "Числа A та B повинні бути різними." << endl;
    }

    // 5. Задано число А. Знайти абсолютне значення А (не використовуючи операцію модуля числа).
    int absValue;
    if (A >= 0) {
        absValue = A;
    }
    else {
        absValue = -A;
    }
    cout << "Абсолютне значення A: " << absValue << endl;

    return 0;
}